# <span style="color:darkblue"> Today: Continue with Pandas groupby </span>

<font size="5"> 

- What are the steps to calculate the average wage of Brazilian and Colombian players by their ```Attacking Work Rate``` (low, medium, high)?

In [2]:
import pandas as pd
fifa = pd.read_csv('../lecture12/fifa23_players.csv')

In [3]:
#
# 1. Create a new data frame that contains only the characteristics we want to use for the rows that we need
fifa_sub = fifa.loc[(fifa['Nationality']=='Brazil') | (fifa['Nationality']=='Colombia'), ['Nationality','Attacking Work Rate', 'Wage(in Euro)']] 

# 2. Use group by where the input is a list with the variables []
fifa_sub.groupby(['Attacking Work Rate', 'Nationality']).mean()

                                 Wage(in Euro)
Attacking Work Rate Nationality
High                Brazil        23955.045872
                    Colombia      11583.146067
Low                 Brazil        14948.148148
                    Colombia       3703.846154
Medium              Brazil        16606.728778
                    Colombia       4411.989796

<font size="5"> 

- What if we want to calculate different statistics for the same variable?

- **Example:** we want to know the average, median, minimum and maximum wage age for players form France

In [14]:
fifa[(fifa['Nationality']=='France') | (fifa['Nationality']=='Colombia')].groupby('Nationality').agg({'Wage(in Euro)':['mean', 'min', 'max']})

            Wage(in Euro)
                     mean  min     max
Nationality
Colombia      6522.818792    0  155000
France       13463.551402  500  450000

<font size="5"> 

- What if we want to calculate different statistics for different variables?

- **Example:** we want to know the average wage, minumum, maximum and average overall, minimum and maximum age for players form France and Argentina

In [16]:
aggregates = {'Wage(in Euro)':['mean'], 'Overall':['mean', 'min', 'max'], 'Age':['min', 'max']}
fifa[(fifa['Nationality']=='France') | (fifa['Nationality']=='Argentina')].groupby('Nationality').agg(aggregates)

            Wage(in Euro)    Overall         Age
                     mean       mean min max min max
Nationality
Argentina     8360.832444  68.633938  55  91  16  42
France       13463.551402  67.523364  53  91  16  41

<font size="5"> 

- We can also create new names for the variables using tuples

In [17]:
fifa.groupby('Nationality', as_index=False).agg(
    # Name average wages for each group
    mean_wage=('Wage(in Euro)', lambda x: sum(x)/len(x)),
    # Name minimum overall for each group
    min_overall=('Overall', min),
    # Name maximum overall for each group
    max_overall=('Overall', max), 
    # Name maximum overall for each group
    average_overall=('Overall', lambda x: sum(x)/len(x))).sort_values(by='average_overall', ascending=False)

        Nationality     mean_wage  min_overall  max_overall  average_overall
89            Libya   8666.666667           70           79        73.333333
154      Uzbekistan  31666.666667           70           75        72.333333
18           Brazil  18745.673077           55           89        71.553571
39   Czech Republic   6176.699029           61           85        71.388350
44            Egypt  43346.153846           53           90        71.384615
..              ...           ...          ...          ...              ...
28         China PR   2294.077449           47           73        57.731207
131       Singapore   2000.000000           55           55        55.000000
72            India    510.502283           47           65        54.342466
11         Barbados    800.000000           54           54        54.000000
135     South Sudan    750.000000           50           56        53.000000

[160 rows x 5 columns]